src/Documents/ВедомостьОценок/ВедомостьОценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьОценок</name>
  <registerRecords>AccumulationRegister.Оценки</registerRecords>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.Предметы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оценки</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/Оценки/Оценки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Оценки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.Предметы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ВедомостьОценок/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.Оценки.Записывать = Истина;

	Для Каждого СтудентОценка Из Оценки Цикл
		Движение = Движения.Оценки.Добавить();
		Движение.Период = Дата;
		Движение.Предмет = Предмет;
		Движение.Студент = СтудентОценка.Студент;
		Движение.Оценка = СтудентОценка.Оценка;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
